Revit 2027 API
BuiltInFailures.SketchFailures.StairOnlyOneConnectedBoundaryError Property
 Stairs require no less than two boundaries (chains of one or more Boundary Lines).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairOnlyOneConnectedBoundaryError { get; }
Public Shared ReadOnly Property StairOnlyOneConnectedBoundaryError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairOnlyOneConnectedBoundaryError {
	FailureDefinitionId^ get ();
}
static member StairOnlyOneConnectedBoundaryError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace